app/controllers/animales_controller.rb

  def index
    @animales = Animale.all
---
SELECT "animales".* FROM "animales"

  def create
    @animale = Animale.new(animale_params)

    respond_to do |format|
      if @animale.save
---
INSERT INTO "animales" ("name", "scientificname", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "MyString"], ["scientificname", "MyString"], ["created_at", 2016-11-18 16:53:31 UTC], ["updated_at", 2016-11-18 16:53:31 UTC]]

  def destroy
    @animale.destroy
---
DELETE FROM "animales" WHERE "animales"."id" = ?  [["id", 980190962]]

    def set_animale
      @animale = Animale.find(params[:id])
---
SELECT  "animales".* FROM "animales" WHERE "animales"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]