app/controllers/distributions_controller.rb

  def index
    @distributions = Distribution.all
---
SELECT "distributions".* FROM "distributions"

  def create
    @distribution = Distribution.new(distribution_params)

    respond_to do |format|
      if @distribution.save
---
INSERT INTO "distributions" ("country", "created_at", "updated_at") VALUES (?, ?, ?)  [["country", "MyString"], ["created_at", 2016-11-18 16:53:32 UTC], ["updated_at", 2016-11-18 16:53:32 UTC]]

  def destroy
    @distribution.destroy
---
DELETE FROM "distributions" WHERE "distributions"."id" = ?  [["id", 980190962]]

    def set_distribution
      @distribution = Distribution.find(params[:id])
---
SELECT  "distributions".* FROM "distributions" WHERE "distributions"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]